<!-- dflook/terraform-github-actions {"workspace":"destroy","backend_type":"remote","plan_modifier":"7f079f76a733662d2c696a3545f2da8f4102514a389633deb175c0b2cdb4aba7","backend":"a462bb8871508068888b2b3aac1422eb3920cc9f7190e0e41ef386de75f1d46e","plan_job_ref":"Job Test plan target and replace #319 at https://github.com/dflook/terraform-github-actions/actions/runs/4293606072","plan_hash":"8007625c650427b0c8b0e545e717e9ecc3c3f1fe2820b9e755306e597e5eabb0","plan_text_format":"text","version":"1.31.1"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __destroy__ workspace
:skull: Planning to destroy all resources
Targeting resources: `random_string.foreach["hello"]`
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 1 to add, 0 to change, 1 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ foreach = "joWTZk0Sqi" -> (known after apply)
╷
│ Warning: Resource targeting is in effect
│ 
│ You are creating a plan with the -target option, which means that the
│ result of this plan may not represent all of the changes requested by the
│ current configuration.
│ 		
│ The -target option is not for routine use, and is provided only for
│ exceptional situations such as recovering from errors or mistakes, or when
│ Terraform specifically suggests to use it as part of an error message.
╵
```
</details>

:memo: Plan generated in [Test plan target and replace #319](https://github.com/dflook/terraform-github-actions/actions/runs/4293606072)